Repository: wp-plugins/fp
Catalog: po/fp-*.po
Languages: ar

# FB Locale
source: en_US
ar: ar_AR

source: Settings
ar: الإعدادات

source: FacePress needs configuration information on its <a href="%s">settings</a> page.
ar: فيسبرس يحتاج إلى ضبط في صفحة <a href="%s">الإعدادات</a>.

source: FacePress Main Settings
ar: إعدادات فيسبرس الرئيسية

source: Facebook API Key
ar: فيسبوك API Key

source: Facebook Application Secret
ar: فيسسبوك Application Secret

source: Facebook Application ID
ar: فيسبوك Application ID

source: Facebook Fan Page
ar: صفحة الفيسبوك

source: FacePress
ar: فيسبرس

source: Options related to the FacePress plugin.
ar: الخيارات المتعلقة بإضافة فيسبرس.

source: Save Changes
ar: حفظ التغييرات

source: To connect your site to Facebook, you will need a Facebook Application. If you have already created one, please insert your API key, Application Secret, and Application ID below.
ar: لتوصيل موقعك بالفيسبوك, ستحتاج إلى تطبيق فيسبوك. إذا كنت تملك واحداً بالفعل, رجاءً أدخل بيانات التطبيق في الأسفل.

source: Can&#39;t find your key?
ar: ألا يمكنك العثور على البيانات؟

source: Get a list of your applications from here: <a target="_blank" href="http://www.facebook.com/developers/apps.php">Facebook Application List</a>
ar: إذهب إلى لائحة تطبيقاتك على الفيسبوك <a target="_blank" href="http://www.facebook.com/developers/apps.php">هنا</a>

source: Select the application you want, then copy and paste the API key, Application Secret, and Application ID from there.
ar: اختر التطبيق الذي تريد, ثم انسخ و الصق البيانات التالية هنا.

source: Haven&#39;t created an application yet?</strong> Don&#39;t worry, it&#39;s easy!
ar: ألم تصنع تطبيقاً بعد؟ لا تقلق الأمر سهل!

source: Go to this link to create your application: <a target="_blank" href="http://developers.facebook.com/setup.php">Facebook Connect Setup</a>
ar: إذهب إلى صفحة فيسبوك لإنشاء <a target="_blank" href="http://developers.facebook.com/setup.php">تطبيق جديد</a>

source: When it tells you to "Upload a file" on step 2, just hit the "Upload Later" button. This plugin takes care of that part for you!
ar: حين يسألك عن الصورة لتطبيقك, يمكنك تجاوز هذه الخطوة و القيام بها لاحقاً.

source: On the final screen, there will be an API Key field, in the yellow box. Copy and paste that information into here.
ar: في الصفحة الأخيرة, سيوجد هناك البيانات المطلوبة, قم بنسخها و لصقها هنا.

source: You can get the rest of the information from the application on the <a target="_blank" href="http://www.facebook.com/developers/apps.php">Facebook Application List</a> page.
ar: يمكنك الحصول على باقي بيانات التطبيق من صفحة <a target="_blank" href="http://www.facebook.com/developers/apps.php">تطبيقات فيسبوك</a>.

source: Facebook doesn&#39;t like your settings, it says:
ar: فيسبوك لا يحب إعداداتك:

source: Your Facebook Application's "Connect URL" is configured incorrectly. It is currently set to "%s" when it should be set to "%s" .
ar: خيار "Connect URL" في تطبيقك غير صحيح, إنه معين إلى "%s" لكن يجب أن يكون "%s".

source: To correct these errors, you may need to <a href="http://www.facebook.com/developers/editapp.php?app_id=%s">edit your applications settings</a> and correct the values therein. The site will not work properly until the errors are corrected.
ar: لتصحيح هذه الأخطاء, ستحتاج إلى <a href="http://www.facebook.com/developers/editapp.php?app_id=%s">تعديل إعدادات تطبيقك</a> و تصحيح القيم هناك. لن يعمل الموقع بشكل صحيح حتى تصلح الأخطاء.

source: (required)
ar: (مطلوب)

source: Here is a <a href="http://www.facebook.com/apps/application.php?id=%s&amp;v=wall">link to your applications wall</a>. There you can give it a name, upload a profile picture, things like that. Look for the &quot;Edit Application&quot; link to modify the application.
ar: هذا رابط إلى <a href="http://www.facebook.com/apps/application.php?id=%s&amp;v=wall">صفحة تطبيقك</a>. يمكنك من هناك تسميته و وضع صورة, و أشياء أخرى كهذه. إبحث عن زر تعديل التطبيق.

source: Some sites use Fan Pages on Facebook to connect with their users. The Application wall acts as a Fan Page in all respects, however some sites have been using Fan Pages previously, and already have communities and content built around them. Facebook offers no way to migrate these, so the option to use an existing Fan Page is offered for people with this situation. Note that this doesn&#39;t <em>replace</em> the application, as that is not optional. However, you can use a Fan Page for specific parts of the FacePress plugin, such as the Fan Box, the Publisher, and the Chicklet.
ar: في بعض الأحيان بعض المواقع تستخدم صفحة فيسبوك. قبل أن تقوم بإنشاء التطبيق, و لا يوجد طريقة في الفيسبوك لدمج الصفحة بالتطبيق, لذا إذا كنت تمتلك صفحة سابقاً و أردت إنشاء تطبيق يمكنك إدخال ID صفحتك هنا.

source: If you have a <a href="http://www.facebook.com/pages/manage/">Fan Page</a> that you want to use for your site, enter the ID of the page here. Most users should leave this blank.
ar: إذا كنت تمتلك <a href="http://www.facebook.com/pages/manage/">صفحة فيسبوك</a> و تريد استحدامها لموقعك, إكتب الـID هنا. أغلب المستخدمين سيتركون هذه الخانة خالية.

source: FacePress Comment function doesn't work with sites that require registration to comment.
ar: تعليقات فيسبرس لا تعمل على المواقع التي تطلب من المستخدم التسجيل من أجل التعليق.

source: Comment Settings
ar: إعدادات التعليقات

source: Allow Facebook users to comment?
ar: السماح لمستخدمي فيسبوك بالتعليق؟

source: Allow facebook users to comment with their FB accounts.
ar: السماح لمستخدمي فيسبوك من التعليق باستخدام حسابهم على الفيسبوك.

source: Hi %s!
ar: مرحباً %s!

source: You are connected with your Facebook account.
ar: انت متصل بحسابك في فيسبوك.

source: Logout
ar: تسجيل الخروج

source: Share Comment on Facebook
ar: مشاركة التعليق على الفيسبوك

source: Connect with Facebook
ar: الاتصال بفيسبوك

source: Facebook Connect
ar: الاتصال بفيسبوك

source: Connect to Facebook
ar: الاتصال بفيسبوك

source: Connected as
ar: متصال باسم

source: Disconnect
ar: إلغاء الاتصال

source: <strong>ERROR</strong>: Facebook user not recognized.
ar: <strong>خطأ</strong>: لم يتم التعرف على مستخدم الفيسبوك.

source: Like Button Settings
ar: إعدادات زر الفيسبوك

source: Like Button Position
ar: موقع زر الفيسبوك

source: Like Button Layout
ar: شكل زر الفيسبوك

source: Like Button Action
ar: نص زر الفيسبوك

source: Like Button CSS
ar: CSS زر الفيسبوك

source: Choose where you want the like button added to your content.
ar: اختر أين تريد أن يظهر زر الفيسبوك.

source: Before the content of your post
ar: قبل محتويات التدوينة

source: After the content of your post
ar: بعد محتويات التدوينة

source: Before AND After the content of your post
ar: فبل و بعد محتويات التدوينة

source: Manually add the button to your theme or posts (use the get_fblike function in your theme)
ar: يدوياً باستخدام fb_like() في القالب و

source: Standard
ar: افتراضي

source: Button with counter
ar: زر مع عدد

source: Like
ar: أحب

source: Recommend
ar: فضل

source: the css style of the like button.
ar: كود الـcss لزر الفيسبوك.

source: All the tools you need to integrate your wordpress and facebook.
ar: كل الأدوات التي تحتاجها لتوصيل ووردبرس مع الفيسبوك.

source: Louy
ar: لؤي
